{"archived_at":"2025-09-11T08:21:52.133105+00:00","reddit_fullname":"t3_wflpur","reddit_id":"wflpur","permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/","title":"First time with a Hotwife in Thailand (long)","selftext":"Back  when Tumblr was a thing (allowed porn) i used to run an account themed around WMAF. It wasn't the biggest but I got quite some followers with my posts. In early 2017 I got a message from one of my asian followers.  He and his wife, let's call them Fred and Jenny, got interested in the  topic of Hotwife. They watched lots of WMAF Videos together so she eventually wanted to try a BWC herself.\n\nAfter  a few messages he showed me some sexy nudes of her and oh, was she perfect. Petite Asian woman in her mid 20's, about 165cm/5'4 tall, shoulder-long black silky hair, perfect tiny a-cup breasts and a cute little ass that is made in heaven.\n\nIt  didn't took too long that Fred gave me Jenny's number and I contacted her. Our messages quickly turned into talking about sex and what she wanted me to do to her. The only problem was...they live on the other  side of the planet and around this time they lived in South Korea for  half a year (not far from their home). One of the places I wish to visit  in my life. But at that time it was just not possible for me and I was  kind of scared to go there on my own.\n\nFast  forward to fall of 2018. I just quit my job, got some extra money from  that and just signed a contract for a new job starting in 2019. With  over a month of spare time I wanted to do something exciting, especially  after living through a short job-related phase of depression. In  december Fred and Jenny took another vacation in Thailand, Pattaya and  asked me to visit them there. When I quit that last job I became more  open to new things but still traveling around the world on my own seemed  a bit scary. That changed when Fred sent me a picture that said: \"If  you really want to do something, you'll find a way. If you don't, you'll  find an excuse\". This picture convinced me to do something and I bought  tickets to fly from Germany to Thailand 7 days later.\n\nArriving in Pattaya I first met up with Fred, Jenny wasn't feeling well and was sleeping. We found a nice Hotel for me near Walking Street where I also  took a nap. The heat during the day in Thailand can be brutal.\n\nIn the evening they came to my hotel, we met in the Lobby. Seeing Jenny in reality was even better than on pictures, even with her clothes on. She  wore a plain white T-Shirt and a small black skirt with flower pattern.  As we hugged I know she could feel my boner already. But before we went  to my room we headed out to eat dinner and have some drinks. We both needed some alcohol to loosen up.\n\nOn Walking Street we went to one of those ping-pong shows. Sticking out as a white guy I was selected to catch a few bananas shot from a Thai girls pussy. The staff thanked me by demanding a tip; overall not such a great show so we bailed soon after. We got us some more drinks and headed to a quiet place near the beach. On our way there Jenny grabbed my hand while Fred danced around enjoying the music and probably imagining what I would do to his wife later.\n\nAt the beach i sat down on a rock and Jenny took the chance to sit on my lap. We talked some more about everything and nothing (honestly I don't remember), all I can remember was Jenny rocking back and forth slowly making my dick press against her ass. It was heaven and hell, since i was only edging the last 7 days to prepare for this night.\n\nFinally we got up and headed back to my hotel. I couldn't resist any longer and grabbed her ass all the time on our way. In the lobby the receptionist wasn't happy to see 3 people head to the elevator. The husband argued some but he wasn't allowed to stay for long. Luckily for me, as I didn't want to have sex with her while being watched. He came with us for a few minutes to say goodbye to his wife as she headed into the shower. Fred gave me some kind of traditional chinese see-thru cosplay for her to wear and begged me a couple of times to take lots of evidence of what was about to happen.\n\nHe left. Finally. I was alone with the woman i yearned to fuck for so long. I watched her in the shower through the glass door while taking my clothes off. Just as i entered the bathroom she stepped out of the shower, surprised to see me. Jenny acted all shy, covering her tits and pussy, asking for me to give her a towel. I could see her eyes were glued to my semi hardon. I handed it to her and gave her a deep long kiss which made her release a nice moan. She broke the kiss suddenly and pointed to the shower. I stepped inside to wash myself, she went back to the bed.\n\nWhen I got out I quickly dried off and hurried back into the room. There she was. Sitting on the edge of the bed. Still wrapped in the towel. Still acting all shy she just sat there. Waiting for me to act.\n\nI got on the bed behind her, laid my arms around her gave Jenny another kiss while gently touching her small boobs. She started moaning again. I squeeze her boobs a little more before unwrapping the towel from her upper body. Her tiny nipples were already hard and for both of us fun to play with.\n\nMy hands were immediately covered in her juices. I looked her in the eyes, smiled and said \"Someones ready\". She smiled back and began giggling.\n\nHer hand reached for my cock now. All shyness was gone from this moment on. She spread her legs more and begann stroking my cock, now feeling the thickness. \"Please\" she said. \"Be gentle. I'm only used to my small husband and toys\". \"Sure\" replied and gave her another kiss.\n\nI pushed her down onto the bed having her lay on her back while i was kneeling next to her face. My cock right over her face. Jenny continued stroking it, looking at it in disbelief. I inserted one finger into her pussy, making her gasp. Soon after adding a second finger. Her pussy was really tight. I knew I had to stretch her more.\n\nWhen I added a third finger I started rubbing her clit with my thumb. She enjoyed it more and more. Now she took the head of my cock in her mouth, gently sucking and licking it inbetween her moans.\n\nAfter a few minutes she said \"Let's try\" and grabbed a condom from the nightstand. I put it on, she spread her legs in missionary and i put my dick on the opening of her pussy. I tried pushing... but there was no way yet. She was just too tight. We used some lube, some more fingering and after a few minutes i was finally able to enter her tight hot hole.\n\nSlowly inching forward, first just the tip piercing her flesh like a spear. Every slow stroke made her release a moan half pleasure, half pain. I focused on her facial expression to go as gentle as possible. Over time more and more inches of my dick were able to disappear inside her while her moans filled more and more with pleasure. Eventually she was relaxed enough to say \"Fuck me\".\n\nStanding beside the bed, I grabbed Jennys legs and started pounding her pussy like a dog in heat. There was no stopping anymore. I kept pounding like this would be the last pussy i will ever fuck. Her pleasure filled moans turned more into screams. This went on for a good 10 minutes before we took a short break to get a drink. We were both not used to this kind of weather and the AC only helped so much.\n\nAfter we caught our breath I suggested to try doggy style. Jenny gave me a dirty smile and grabbed my cock, guiding me back to the bed. My hands and eyes were glued to her perfect little ass as she slowly put her knees on the bed, then even slower lowered her hands and upper body onto the matress presenting her behind to me like a cat in heat.\n\nJust to be safe I used a little more lube again before sticking my cock back into her tight pussy. This time it went in much easier and made her let out a long \"Oh fuuuuuck\". While pounding her from behind i gave her ass some slaps. It made her squeal and clench her pussy every time. I had the feeling she was much more into the hotwife scenario than i thought so i gave her some dirty talk like having to punish this dirty cheating wife. It had just the effect i wanted. She grabbed a pillow and buried her face into it, screaming as her pussy contracts around my dick.\n\nWhen Jenny came down from her orgasm I pulled my dick out of her and laid on the bed next to her. She looked at me with a big smile, then kissed and hugged me. She thanked me for making her dream come true. I told her the same and gave her another kiss. But then she grabbed my dick and looked at the still empty condom. \"You didn't cum yet\" she said. \"We need to change that\". She stroked my dick and asked what we should do. I was pretty beat already since i didn't have this kind of action for quite some time so I asked if she could do the work now.\n\nAnother deep and long kiss later she got up and mounted me in cowgirl position. The view was pure bliss. Her wet pussy on my dick going up and down, her tiny tits gently bobbing up and down, waiting to be grabbed and played with. Her long black hair swinging over my sweatty body, tickling me with every touch sending shivers through my body. She kept it up for a hand full of minutes before eventually she also couldn't go on anymore. Both beat we laid next to each other gently caressing our privates while kissing some more.\n\n\"Are you happy?\" I asked her. \"Yes, of course\" she answered with the brightest smile I have ever seen on someones face. \"You?\" She asked. \"Almost\" I said, ripping the condom off and kissing up and down her body while stroking my cock. I needed to cum. On her. Like marking my terretory. \"Not on my face please\" Jenny said. I positioned myself between her spread legs. The view of her glistening pussy and her hard nipples did the trick now. I aimed for her belly but i often have lots of pressure when I cum.\n\nA good amount of cum dribbled down on her bellybutton before at least 10 solid shots flew past her belly, over her tits and still hitting her face. She got absolutely plastered. I couldn't refrain from laughing.\n\nI got up to grab her a towel, soon after we found ourselves in the shower again, this time together. Still kissing every now and then before getting ready to actually sleep.\n\n&#x200B;\n\nI will stop here now, this story took too long to write and turned out to be too long i guess.\n\nNothing much happened after. The next night we were both still in pattaya but she wouldn't have sex with me again since her pussy hurt (for about 4 days she told me later).\n\nTo this day we still want to meet again but you know...life happens.\n\nI did take pictures of the night but I respect both of them and so far I only got the OK to share pictures on my phone with my friends but not spread them anywhere.\n\n&#x200B;\n\nI would be happy to get some comments about my first story","author":"conottre","author_fullname":"t2_33gv3s5o","subreddit":"sexstories","subreddit_id":"t5_2qt19","created_utc":1659569918,"is_self":true,"url":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/","domain":"self.sexstories","post_hint":null,"is_gallery":false,"over_18":true,"spoiler":false,"link_flair_text":"NonFiction ","is_original_content":false,"stickied":false,"locked":false,"edited":false,"num_comments":7,"score":32,"upvote_ratio":0.88,"media":null,"external_link":null,"raw_post":{"approved_at_utc":null,"subreddit":"sexstories","selftext":"Back  when Tumblr was a thing (allowed porn) i used to run an account themed around WMAF. It wasn't the biggest but I got quite some followers with my posts. In early 2017 I got a message from one of my asian followers.  He and his wife, let's call them Fred and Jenny, got interested in the  topic of Hotwife. They watched lots of WMAF Videos together so she eventually wanted to try a BWC herself.\n\nAfter  a few messages he showed me some sexy nudes of her and oh, was she perfect. Petite Asian woman in her mid 20's, about 165cm/5'4 tall, shoulder-long black silky hair, perfect tiny a-cup breasts and a cute little ass that is made in heaven.\n\nIt  didn't took too long that Fred gave me Jenny's number and I contacted her. Our messages quickly turned into talking about sex and what she wanted me to do to her. The only problem was...they live on the other  side of the planet and around this time they lived in South Korea for  half a year (not far from their home). One of the places I wish to visit  in my life. But at that time it was just not possible for me and I was  kind of scared to go there on my own.\n\nFast  forward to fall of 2018. I just quit my job, got some extra money from  that and just signed a contract for a new job starting in 2019. With  over a month of spare time I wanted to do something exciting, especially  after living through a short job-related phase of depression. In  december Fred and Jenny took another vacation in Thailand, Pattaya and  asked me to visit them there. When I quit that last job I became more  open to new things but still traveling around the world on my own seemed  a bit scary. That changed when Fred sent me a picture that said: \"If  you really want to do something, you'll find a way. If you don't, you'll  find an excuse\". This picture convinced me to do something and I bought  tickets to fly from Germany to Thailand 7 days later.\n\nArriving in Pattaya I first met up with Fred, Jenny wasn't feeling well and was sleeping. We found a nice Hotel for me near Walking Street where I also  took a nap. The heat during the day in Thailand can be brutal.\n\nIn the evening they came to my hotel, we met in the Lobby. Seeing Jenny in reality was even better than on pictures, even with her clothes on. She  wore a plain white T-Shirt and a small black skirt with flower pattern.  As we hugged I know she could feel my boner already. But before we went  to my room we headed out to eat dinner and have some drinks. We both needed some alcohol to loosen up.\n\nOn Walking Street we went to one of those ping-pong shows. Sticking out as a white guy I was selected to catch a few bananas shot from a Thai girls pussy. The staff thanked me by demanding a tip; overall not such a great show so we bailed soon after. We got us some more drinks and headed to a quiet place near the beach. On our way there Jenny grabbed my hand while Fred danced around enjoying the music and probably imagining what I would do to his wife later.\n\nAt the beach i sat down on a rock and Jenny took the chance to sit on my lap. We talked some more about everything and nothing (honestly I don't remember), all I can remember was Jenny rocking back and forth slowly making my dick press against her ass. It was heaven and hell, since i was only edging the last 7 days to prepare for this night.\n\nFinally we got up and headed back to my hotel. I couldn't resist any longer and grabbed her ass all the time on our way. In the lobby the receptionist wasn't happy to see 3 people head to the elevator. The husband argued some but he wasn't allowed to stay for long. Luckily for me, as I didn't want to have sex with her while being watched. He came with us for a few minutes to say goodbye to his wife as she headed into the shower. Fred gave me some kind of traditional chinese see-thru cosplay for her to wear and begged me a couple of times to take lots of evidence of what was about to happen.\n\nHe left. Finally. I was alone with the woman i yearned to fuck for so long. I watched her in the shower through the glass door while taking my clothes off. Just as i entered the bathroom she stepped out of the shower, surprised to see me. Jenny acted all shy, covering her tits and pussy, asking for me to give her a towel. I could see her eyes were glued to my semi hardon. I handed it to her and gave her a deep long kiss which made her release a nice moan. She broke the kiss suddenly and pointed to the shower. I stepped inside to wash myself, she went back to the bed.\n\nWhen I got out I quickly dried off and hurried back into the room. There she was. Sitting on the edge of the bed. Still wrapped in the towel. Still acting all shy she just sat there. Waiting for me to act.\n\nI got on the bed behind her, laid my arms around her gave Jenny another kiss while gently touching her small boobs. She started moaning again. I squeeze her boobs a little more before unwrapping the towel from her upper body. Her tiny nipples were already hard and for both of us fun to play with.\n\nMy hands were immediately covered in her juices. I looked her in the eyes, smiled and said \"Someones ready\". She smiled back and began giggling.\n\nHer hand reached for my cock now. All shyness was gone from this moment on. She spread her legs more and begann stroking my cock, now feeling the thickness. \"Please\" she said. \"Be gentle. I'm only used to my small husband and toys\". \"Sure\" replied and gave her another kiss.\n\nI pushed her down onto the bed having her lay on her back while i was kneeling next to her face. My cock right over her face. Jenny continued stroking it, looking at it in disbelief. I inserted one finger into her pussy, making her gasp. Soon after adding a second finger. Her pussy was really tight. I knew I had to stretch her more.\n\nWhen I added a third finger I started rubbing her clit with my thumb. She enjoyed it more and more. Now she took the head of my cock in her mouth, gently sucking and licking it inbetween her moans.\n\nAfter a few minutes she said \"Let's try\" and grabbed a condom from the nightstand. I put it on, she spread her legs in missionary and i put my dick on the opening of her pussy. I tried pushing... but there was no way yet. She was just too tight. We used some lube, some more fingering and after a few minutes i was finally able to enter her tight hot hole.\n\nSlowly inching forward, first just the tip piercing her flesh like a spear. Every slow stroke made her release a moan half pleasure, half pain. I focused on her facial expression to go as gentle as possible. Over time more and more inches of my dick were able to disappear inside her while her moans filled more and more with pleasure. Eventually she was relaxed enough to say \"Fuck me\".\n\nStanding beside the bed, I grabbed Jennys legs and started pounding her pussy like a dog in heat. There was no stopping anymore. I kept pounding like this would be the last pussy i will ever fuck. Her pleasure filled moans turned more into screams. This went on for a good 10 minutes before we took a short break to get a drink. We were both not used to this kind of weather and the AC only helped so much.\n\nAfter we caught our breath I suggested to try doggy style. Jenny gave me a dirty smile and grabbed my cock, guiding me back to the bed. My hands and eyes were glued to her perfect little ass as she slowly put her knees on the bed, then even slower lowered her hands and upper body onto the matress presenting her behind to me like a cat in heat.\n\nJust to be safe I used a little more lube again before sticking my cock back into her tight pussy. This time it went in much easier and made her let out a long \"Oh fuuuuuck\". While pounding her from behind i gave her ass some slaps. It made her squeal and clench her pussy every time. I had the feeling she was much more into the hotwife scenario than i thought so i gave her some dirty talk like having to punish this dirty cheating wife. It had just the effect i wanted. She grabbed a pillow and buried her face into it, screaming as her pussy contracts around my dick.\n\nWhen Jenny came down from her orgasm I pulled my dick out of her and laid on the bed next to her. She looked at me with a big smile, then kissed and hugged me. She thanked me for making her dream come true. I told her the same and gave her another kiss. But then she grabbed my dick and looked at the still empty condom. \"You didn't cum yet\" she said. \"We need to change that\". She stroked my dick and asked what we should do. I was pretty beat already since i didn't have this kind of action for quite some time so I asked if she could do the work now.\n\nAnother deep and long kiss later she got up and mounted me in cowgirl position. The view was pure bliss. Her wet pussy on my dick going up and down, her tiny tits gently bobbing up and down, waiting to be grabbed and played with. Her long black hair swinging over my sweatty body, tickling me with every touch sending shivers through my body. She kept it up for a hand full of minutes before eventually she also couldn't go on anymore. Both beat we laid next to each other gently caressing our privates while kissing some more.\n\n\"Are you happy?\" I asked her. \"Yes, of course\" she answered with the brightest smile I have ever seen on someones face. \"You?\" She asked. \"Almost\" I said, ripping the condom off and kissing up and down her body while stroking my cock. I needed to cum. On her. Like marking my terretory. \"Not on my face please\" Jenny said. I positioned myself between her spread legs. The view of her glistening pussy and her hard nipples did the trick now. I aimed for her belly but i often have lots of pressure when I cum.\n\nA good amount of cum dribbled down on her bellybutton before at least 10 solid shots flew past her belly, over her tits and still hitting her face. She got absolutely plastered. I couldn't refrain from laughing.\n\nI got up to grab her a towel, soon after we found ourselves in the shower again, this time together. Still kissing every now and then before getting ready to actually sleep.\n\n&#x200B;\n\nI will stop here now, this story took too long to write and turned out to be too long i guess.\n\nNothing much happened after. The next night we were both still in pattaya but she wouldn't have sex with me again since her pussy hurt (for about 4 days she told me later).\n\nTo this day we still want to meet again but you know...life happens.\n\nI did take pictures of the night but I respect both of them and so far I only got the OK to share pictures on my phone with my friends but not spread them anywhere.\n\n&#x200B;\n\nI would be happy to get some comments about my first story","user_reports":[],"saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"First time with a Hotwife in Thailand (long)","link_flair_richtext":[],"subreddit_name_prefixed":"r/sexstories","hidden":false,"pwls":null,"link_flair_css_class":"","downs":0,"thumbnail_height":null,"top_awarded_type":null,"hide_score":false,"name":"t3_wflpur","quarantine":false,"link_flair_text_color":"dark","upvote_ratio":0.88,"author_flair_background_color":null,"subreddit_type":"public","ups":32,"total_awards_received":0,"media_embed":{},"thumbnail_width":null,"author_flair_template_id":null,"is_original_content":false,"author_fullname":"t2_33gv3s5o","secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"NonFiction ","can_mod_post":false,"score":32,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"self","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"content_categories":null,"is_self":true,"mod_note":null,"created":1659569918,"link_flair_type":"text","wls":null,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"self.sexstories","allow_live_comments":false,"selftext_html":"<!-- SC_OFF --><div class=\"md\"><p>Back  when Tumblr was a thing (allowed porn) i used to run an account themed around WMAF. It wasn&#39;t the biggest but I got quite some followers with my posts. In early 2017 I got a message from one of my asian followers.  He and his wife, let&#39;s call them Fred and Jenny, got interested in the  topic of Hotwife. They watched lots of WMAF Videos together so she eventually wanted to try a BWC herself.</p>\n\n<p>After  a few messages he showed me some sexy nudes of her and oh, was she perfect. Petite Asian woman in her mid 20&#39;s, about 165cm/5&#39;4 tall, shoulder-long black silky hair, perfect tiny a-cup breasts and a cute little ass that is made in heaven.</p>\n\n<p>It  didn&#39;t took too long that Fred gave me Jenny&#39;s number and I contacted her. Our messages quickly turned into talking about sex and what she wanted me to do to her. The only problem was...they live on the other  side of the planet and around this time they lived in South Korea for  half a year (not far from their home). One of the places I wish to visit  in my life. But at that time it was just not possible for me and I was  kind of scared to go there on my own.</p>\n\n<p>Fast  forward to fall of 2018. I just quit my job, got some extra money from  that and just signed a contract for a new job starting in 2019. With  over a month of spare time I wanted to do something exciting, especially  after living through a short job-related phase of depression. In  december Fred and Jenny took another vacation in Thailand, Pattaya and  asked me to visit them there. When I quit that last job I became more  open to new things but still traveling around the world on my own seemed  a bit scary. That changed when Fred sent me a picture that said: &quot;If  you really want to do something, you&#39;ll find a way. If you don&#39;t, you&#39;ll  find an excuse&quot;. This picture convinced me to do something and I bought  tickets to fly from Germany to Thailand 7 days later.</p>\n\n<p>Arriving in Pattaya I first met up with Fred, Jenny wasn&#39;t feeling well and was sleeping. We found a nice Hotel for me near Walking Street where I also  took a nap. The heat during the day in Thailand can be brutal.</p>\n\n<p>In the evening they came to my hotel, we met in the Lobby. Seeing Jenny in reality was even better than on pictures, even with her clothes on. She  wore a plain white T-Shirt and a small black skirt with flower pattern.  As we hugged I know she could feel my boner already. But before we went  to my room we headed out to eat dinner and have some drinks. We both needed some alcohol to loosen up.</p>\n\n<p>On Walking Street we went to one of those ping-pong shows. Sticking out as a white guy I was selected to catch a few bananas shot from a Thai girls pussy. The staff thanked me by demanding a tip; overall not such a great show so we bailed soon after. We got us some more drinks and headed to a quiet place near the beach. On our way there Jenny grabbed my hand while Fred danced around enjoying the music and probably imagining what I would do to his wife later.</p>\n\n<p>At the beach i sat down on a rock and Jenny took the chance to sit on my lap. We talked some more about everything and nothing (honestly I don&#39;t remember), all I can remember was Jenny rocking back and forth slowly making my dick press against her ass. It was heaven and hell, since i was only edging the last 7 days to prepare for this night.</p>\n\n<p>Finally we got up and headed back to my hotel. I couldn&#39;t resist any longer and grabbed her ass all the time on our way. In the lobby the receptionist wasn&#39;t happy to see 3 people head to the elevator. The husband argued some but he wasn&#39;t allowed to stay for long. Luckily for me, as I didn&#39;t want to have sex with her while being watched. He came with us for a few minutes to say goodbye to his wife as she headed into the shower. Fred gave me some kind of traditional chinese see-thru cosplay for her to wear and begged me a couple of times to take lots of evidence of what was about to happen.</p>\n\n<p>He left. Finally. I was alone with the woman i yearned to fuck for so long. I watched her in the shower through the glass door while taking my clothes off. Just as i entered the bathroom she stepped out of the shower, surprised to see me. Jenny acted all shy, covering her tits and pussy, asking for me to give her a towel. I could see her eyes were glued to my semi hardon. I handed it to her and gave her a deep long kiss which made her release a nice moan. She broke the kiss suddenly and pointed to the shower. I stepped inside to wash myself, she went back to the bed.</p>\n\n<p>When I got out I quickly dried off and hurried back into the room. There she was. Sitting on the edge of the bed. Still wrapped in the towel. Still acting all shy she just sat there. Waiting for me to act.</p>\n\n<p>I got on the bed behind her, laid my arms around her gave Jenny another kiss while gently touching her small boobs. She started moaning again. I squeeze her boobs a little more before unwrapping the towel from her upper body. Her tiny nipples were already hard and for both of us fun to play with.</p>\n\n<p>My hands were immediately covered in her juices. I looked her in the eyes, smiled and said &quot;Someones ready&quot;. She smiled back and began giggling.</p>\n\n<p>Her hand reached for my cock now. All shyness was gone from this moment on. She spread her legs more and begann stroking my cock, now feeling the thickness. &quot;Please&quot; she said. &quot;Be gentle. I&#39;m only used to my small husband and toys&quot;. &quot;Sure&quot; replied and gave her another kiss.</p>\n\n<p>I pushed her down onto the bed having her lay on her back while i was kneeling next to her face. My cock right over her face. Jenny continued stroking it, looking at it in disbelief. I inserted one finger into her pussy, making her gasp. Soon after adding a second finger. Her pussy was really tight. I knew I had to stretch her more.</p>\n\n<p>When I added a third finger I started rubbing her clit with my thumb. She enjoyed it more and more. Now she took the head of my cock in her mouth, gently sucking and licking it inbetween her moans.</p>\n\n<p>After a few minutes she said &quot;Let&#39;s try&quot; and grabbed a condom from the nightstand. I put it on, she spread her legs in missionary and i put my dick on the opening of her pussy. I tried pushing... but there was no way yet. She was just too tight. We used some lube, some more fingering and after a few minutes i was finally able to enter her tight hot hole.</p>\n\n<p>Slowly inching forward, first just the tip piercing her flesh like a spear. Every slow stroke made her release a moan half pleasure, half pain. I focused on her facial expression to go as gentle as possible. Over time more and more inches of my dick were able to disappear inside her while her moans filled more and more with pleasure. Eventually she was relaxed enough to say &quot;Fuck me&quot;.</p>\n\n<p>Standing beside the bed, I grabbed Jennys legs and started pounding her pussy like a dog in heat. There was no stopping anymore. I kept pounding like this would be the last pussy i will ever fuck. Her pleasure filled moans turned more into screams. This went on for a good 10 minutes before we took a short break to get a drink. We were both not used to this kind of weather and the AC only helped so much.</p>\n\n<p>After we caught our breath I suggested to try doggy style. Jenny gave me a dirty smile and grabbed my cock, guiding me back to the bed. My hands and eyes were glued to her perfect little ass as she slowly put her knees on the bed, then even slower lowered her hands and upper body onto the matress presenting her behind to me like a cat in heat.</p>\n\n<p>Just to be safe I used a little more lube again before sticking my cock back into her tight pussy. This time it went in much easier and made her let out a long &quot;Oh fuuuuuck&quot;. While pounding her from behind i gave her ass some slaps. It made her squeal and clench her pussy every time. I had the feeling she was much more into the hotwife scenario than i thought so i gave her some dirty talk like having to punish this dirty cheating wife. It had just the effect i wanted. She grabbed a pillow and buried her face into it, screaming as her pussy contracts around my dick.</p>\n\n<p>When Jenny came down from her orgasm I pulled my dick out of her and laid on the bed next to her. She looked at me with a big smile, then kissed and hugged me. She thanked me for making her dream come true. I told her the same and gave her another kiss. But then she grabbed my dick and looked at the still empty condom. &quot;You didn&#39;t cum yet&quot; she said. &quot;We need to change that&quot;. She stroked my dick and asked what we should do. I was pretty beat already since i didn&#39;t have this kind of action for quite some time so I asked if she could do the work now.</p>\n\n<p>Another deep and long kiss later she got up and mounted me in cowgirl position. The view was pure bliss. Her wet pussy on my dick going up and down, her tiny tits gently bobbing up and down, waiting to be grabbed and played with. Her long black hair swinging over my sweatty body, tickling me with every touch sending shivers through my body. She kept it up for a hand full of minutes before eventually she also couldn&#39;t go on anymore. Both beat we laid next to each other gently caressing our privates while kissing some more.</p>\n\n<p>&quot;Are you happy?&quot; I asked her. &quot;Yes, of course&quot; she answered with the brightest smile I have ever seen on someones face. &quot;You?&quot; She asked. &quot;Almost&quot; I said, ripping the condom off and kissing up and down her body while stroking my cock. I needed to cum. On her. Like marking my terretory. &quot;Not on my face please&quot; Jenny said. I positioned myself between her spread legs. The view of her glistening pussy and her hard nipples did the trick now. I aimed for her belly but i often have lots of pressure when I cum.</p>\n\n<p>A good amount of cum dribbled down on her bellybutton before at least 10 solid shots flew past her belly, over her tits and still hitting her face. She got absolutely plastered. I couldn&#39;t refrain from laughing.</p>\n\n<p>I got up to grab her a towel, soon after we found ourselves in the shower again, this time together. Still kissing every now and then before getting ready to actually sleep.</p>\n\n<p>&#x200B;</p>\n\n<p>I will stop here now, this story took too long to write and turned out to be too long i guess.</p>\n\n<p>Nothing much happened after. The next night we were both still in pattaya but she wouldn&#39;t have sex with me again since her pussy hurt (for about 4 days she told me later).</p>\n\n<p>To this day we still want to meet again but you know...life happens.</p>\n\n<p>I did take pictures of the night but I respect both of them and so far I only got the OK to share pictures on my phone with my friends but not spread them anywhere.</p>\n\n<p>&#x200B;</p>\n\n<p>I would be happy to get some comments about my first story</p>\n</div><!-- SC_ON -->","likes":null,"suggested_sort":"confidence","banned_at_utc":null,"view_count":null,"archived":false,"no_follow":false,"is_crosspostable":true,"pinned":false,"over_18":true,"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"74593c62-92e8-11e9-9b6e-0efac8d64f96","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"num_reports":null,"distinguished":null,"subreddit_id":"t5_2qt19","author_is_blocked":false,"mod_reason_by":null,"removal_reason":null,"link_flair_background_color":"#dadada","id":"wflpur","is_robot_indexable":true,"num_duplicates":0,"report_reasons":null,"author":"conottre","discussion_type":null,"num_comments":7,"send_replies":true,"media":null,"contest_mode":false,"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/","stickied":false,"url":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/","subreddit_subscribers":709419,"created_utc":1659569918,"num_crossposts":0,"mod_reports":[],"is_video":false},"raw_comments":{"kind":"Listing","data":{"after":null,"dist":null,"modhash":null,"geo_filter":"","children":[{"kind":"t1","data":{"total_awards_received":0,"approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"ups":1,"removal_reason":null,"link_id":"t3_wflpur","author_flair_template_id":null,"likes":null,"replies":{"kind":"Listing","data":{"after":null,"dist":null,"modhash":null,"geo_filter":"","children":[{"kind":"t1","data":{"subreddit_id":"t5_2qt19","approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"author_flair_type":"text","total_awards_received":0,"subreddit":"sexstories","author_flair_template_id":null,"likes":null,"replies":"","user_reports":[],"saved":false,"id":"iiuqg8t","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"conottre","can_mod_post":false,"created_utc":1659572983,"send_replies":true,"parent_id":"t1_iiunjku","score":1,"author_fullname":"t2_33gv3s5o","removal_reason":null,"approved_by":null,"mod_note":null,"all_awardings":[],"body":"Thank you very much 😊","edited":false,"top_awarded_type":null,"author_flair_css_class":null,"name":"t1_iiuqg8t","is_submitter":true,"downs":0,"author_flair_richtext":[],"author_patreon_flair":false,"body_html":"<div class=\"md\"><p>Thank you very much 😊</p>\n</div>","gildings":{},"collapsed_reason":null,"distinguished":null,"associated_award":null,"stickied":false,"author_premium":false,"can_gild":false,"link_id":"t3_wflpur","unrepliable_reason":null,"author_flair_text_color":null,"score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iiuqg8t/","subreddit_type":"public","locked":false,"report_reasons":null,"created":1659572983,"author_flair_text":null,"treatment_tags":[],"collapsed":false,"subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":1,"author_flair_background_color":null,"collapsed_because_crowd_control":null,"mod_reports":[],"num_reports":null,"ups":1}}],"before":null}},"user_reports":[],"saved":false,"id":"iiunjku","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"[deleted]","can_mod_post":false,"send_replies":true,"parent_id":"t3_wflpur","score":1,"approved_by":null,"report_reasons":null,"all_awardings":[],"subreddit_id":"t5_2qt19","body":"This is amazing . Well done 👏","edited":false,"downs":0,"author_flair_css_class":null,"collapsed":false,"is_submitter":false,"body_html":"<div class=\"md\"><p>This is amazing . Well done 👏</p>\n</div>","gildings":{},"collapsed_reason":null,"associated_award":null,"stickied":false,"subreddit_type":"public","can_gild":false,"top_awarded_type":null,"unrepliable_reason":null,"author_flair_text_color":"dark","score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iiunjku/","num_reports":null,"locked":false,"name":"t1_iiunjku","created":1659571652,"subreddit":"sexstories","author_flair_text":null,"treatment_tags":[],"created_utc":1659571652,"subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":0,"author_flair_background_color":"","collapsed_because_crowd_control":null,"mod_reports":[],"mod_note":null,"distinguished":null}},{"kind":"t1","data":{"total_awards_received":0,"approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"ups":1,"removal_reason":null,"link_id":"t3_wflpur","author_flair_template_id":null,"likes":null,"replies":"","user_reports":[],"saved":false,"id":"iiunkoy","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"[deleted]","can_mod_post":false,"send_replies":true,"parent_id":"t3_wflpur","score":1,"approved_by":null,"report_reasons":null,"all_awardings":[],"subreddit_id":"t5_2qt19","body":"!updateme","edited":false,"downs":0,"author_flair_css_class":null,"collapsed":false,"is_submitter":false,"body_html":"<div class=\"md\"><p>!updateme</p>\n</div>","gildings":{},"collapsed_reason":null,"associated_award":null,"stickied":false,"subreddit_type":"public","can_gild":false,"top_awarded_type":null,"unrepliable_reason":null,"author_flair_text_color":"dark","score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iiunkoy/","num_reports":null,"locked":false,"name":"t1_iiunkoy","created":1659571666,"subreddit":"sexstories","author_flair_text":null,"treatment_tags":[],"created_utc":1659571666,"subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":0,"author_flair_background_color":"","collapsed_because_crowd_control":null,"mod_reports":[],"mod_note":null,"distinguished":null}},{"kind":"t1","data":{"subreddit_id":"t5_2qt19","approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"author_flair_type":"text","total_awards_received":0,"subreddit":"sexstories","author_flair_template_id":null,"likes":null,"replies":"","user_reports":[],"saved":false,"id":"iivimyz","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"DyMoNaStY","can_mod_post":false,"created_utc":1659586702,"send_replies":true,"parent_id":"t3_wflpur","score":1,"author_fullname":"t2_4lrssrkw","approved_by":null,"mod_note":null,"all_awardings":[],"collapsed":false,"body":"amazing story.","edited":false,"top_awarded_type":null,"author_flair_css_class":null,"name":"t1_iivimyz","is_submitter":false,"downs":0,"author_flair_richtext":[],"author_patreon_flair":false,"body_html":"<div class=\"md\"><p>amazing story.</p>\n</div>","removal_reason":null,"collapsed_reason":null,"distinguished":null,"associated_award":null,"stickied":false,"author_premium":false,"can_gild":false,"gildings":{},"unrepliable_reason":null,"author_flair_text_color":null,"score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iivimyz/","subreddit_type":"public","locked":false,"report_reasons":null,"created":1659586702,"author_flair_text":null,"treatment_tags":[],"link_id":"t3_wflpur","subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":0,"author_flair_background_color":null,"collapsed_because_crowd_control":null,"mod_reports":[],"num_reports":null,"ups":1}},{"kind":"t1","data":{"subreddit_id":"t5_2qt19","approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"author_flair_type":"text","total_awards_received":0,"subreddit":"sexstories","author_flair_template_id":null,"likes":null,"replies":"","user_reports":[],"saved":false,"id":"iivinjr","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"DyMoNaStY","can_mod_post":false,"created_utc":1659586710,"send_replies":true,"parent_id":"t3_wflpur","score":1,"author_fullname":"t2_4lrssrkw","approved_by":null,"mod_note":null,"all_awardings":[],"collapsed":false,"body":"!updateme","edited":false,"top_awarded_type":null,"author_flair_css_class":null,"name":"t1_iivinjr","is_submitter":false,"downs":0,"author_flair_richtext":[],"author_patreon_flair":false,"body_html":"<div class=\"md\"><p>!updateme</p>\n</div>","removal_reason":null,"collapsed_reason":null,"distinguished":null,"associated_award":null,"stickied":false,"author_premium":false,"can_gild":false,"gildings":{},"unrepliable_reason":null,"author_flair_text_color":null,"score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iivinjr/","subreddit_type":"public","locked":false,"report_reasons":null,"created":1659586710,"author_flair_text":null,"treatment_tags":[],"link_id":"t3_wflpur","subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":0,"author_flair_background_color":null,"collapsed_because_crowd_control":null,"mod_reports":[],"num_reports":null,"ups":1}},{"kind":"t1","data":{"subreddit_id":"t5_2qt19","approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"author_flair_type":"text","total_awards_received":0,"subreddit":"sexstories","author_flair_template_id":null,"likes":null,"replies":"","user_reports":[],"saved":false,"id":"iivnqu6","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"tastagain","can_mod_post":false,"created_utc":1659589709,"send_replies":true,"parent_id":"t3_wflpur","score":1,"author_fullname":"t2_7wxn85dx","approved_by":null,"mod_note":null,"all_awardings":[],"collapsed":false,"body":"Great, good to hear about it","edited":false,"top_awarded_type":null,"author_flair_css_class":null,"name":"t1_iivnqu6","is_submitter":false,"downs":0,"author_flair_richtext":[],"author_patreon_flair":false,"body_html":"<div class=\"md\"><p>Great, good to hear about it</p>\n</div>","removal_reason":null,"collapsed_reason":null,"distinguished":null,"associated_award":null,"stickied":false,"author_premium":false,"can_gild":false,"gildings":{},"unrepliable_reason":null,"author_flair_text_color":null,"score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iivnqu6/","subreddit_type":"public","locked":false,"report_reasons":null,"created":1659589709,"author_flair_text":null,"treatment_tags":[],"link_id":"t3_wflpur","subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":0,"author_flair_background_color":null,"collapsed_because_crowd_control":null,"mod_reports":[],"num_reports":null,"ups":1}},{"kind":"t1","data":{"subreddit_id":"t5_2qt19","approved_at_utc":null,"author_is_blocked":false,"comment_type":null,"awarders":[],"mod_reason_by":null,"banned_by":null,"author_flair_type":"text","total_awards_received":0,"subreddit":"sexstories","author_flair_template_id":null,"likes":null,"replies":"","user_reports":[],"saved":false,"id":"in10ktn","banned_at_utc":null,"mod_reason_title":null,"gilded":0,"archived":false,"collapsed_reason_code":null,"no_follow":true,"author":"CVArt","can_mod_post":false,"created_utc":1662275946,"send_replies":true,"parent_id":"t3_wflpur","score":1,"author_fullname":"t2_2sawt9t9","approved_by":null,"mod_note":null,"all_awardings":[],"collapsed":false,"body":"Well written and sexy hot too.","edited":false,"top_awarded_type":null,"author_flair_css_class":null,"name":"t1_in10ktn","is_submitter":false,"downs":0,"author_flair_richtext":[],"author_patreon_flair":false,"body_html":"<div class=\"md\"><p>Well written and sexy hot too.</p>\n</div>","removal_reason":null,"collapsed_reason":null,"distinguished":null,"associated_award":null,"stickied":false,"author_premium":false,"can_gild":false,"gildings":{},"unrepliable_reason":null,"author_flair_text_color":null,"score_hidden":false,"permalink":"/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/in10ktn/","subreddit_type":"public","locked":false,"report_reasons":null,"created":1662275946,"author_flair_text":null,"treatment_tags":[],"link_id":"t3_wflpur","subreddit_name_prefixed":"r/sexstories","controversiality":0,"depth":0,"author_flair_background_color":null,"collapsed_because_crowd_control":null,"mod_reports":[],"num_reports":null,"ups":1}}],"before":null}},"comments_truncated_by_depth":true,"comments_truncated_by_limit":false,"comments":[{"id":"iiunjku","author":"[deleted]","author_fullname":null,"body":"This is amazing . Well done 👏","score":1,"created_utc":1659571652,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iiunjku/","is_submitter":false,"parent_id":"t3_wflpur","replies":[{"id":"iiuqg8t","author":"conottre","author_fullname":"t2_33gv3s5o","body":"Thank you very much 😊","score":1,"created_utc":1659572983,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iiuqg8t/","is_submitter":true,"parent_id":"t1_iiunjku","replies":[]}]},{"id":"iiunkoy","author":"[deleted]","author_fullname":null,"body":"!updateme","score":1,"created_utc":1659571666,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iiunkoy/","is_submitter":false,"parent_id":"t3_wflpur","replies":[]},{"id":"iivimyz","author":"DyMoNaStY","author_fullname":"t2_4lrssrkw","body":"amazing story.","score":1,"created_utc":1659586702,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iivimyz/","is_submitter":false,"parent_id":"t3_wflpur","replies":[]},{"id":"iivinjr","author":"DyMoNaStY","author_fullname":"t2_4lrssrkw","body":"!updateme","score":1,"created_utc":1659586710,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iivinjr/","is_submitter":false,"parent_id":"t3_wflpur","replies":[]},{"id":"iivnqu6","author":"tastagain","author_fullname":"t2_7wxn85dx","body":"Great, good to hear about it","score":1,"created_utc":1659589709,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/iivnqu6/","is_submitter":false,"parent_id":"t3_wflpur","replies":[]},{"id":"in10ktn","author":"CVArt","author_fullname":"t2_2sawt9t9","body":"Well written and sexy hot too.","score":1,"created_utc":1662275946,"permalink":"https://www.reddit.com/r/sexstories/comments/wflpur/first_time_with_a_hotwife_in_thailand_long/in10ktn/","is_submitter":false,"parent_id":"t3_wflpur","replies":[]}],"media_kind":"self"}