{"archived_at":"2025-08-12T18:20:10.301538+00:00","reddit_fullname":"t3_yg6jcx","reddit_id":"yg6jcx","permalink":"https://www.reddit.com/r/sexstories/comments/yg6jcx/sugar_rush_a_sugar_babys_yacht_weekend_has_more/","title":"Sugar Rush: A sugar baby's yacht weekend has more seamen than expected [FM+, gangbang, CNC, rough] PART 1","selftext":"At 430PM on a beautiful Friday afternoon Leah powered down her computer, grinning sheepishly to herself as she got up from her desk.\n\nShe was going away on a special trip out to sea, a trip she couldn't stop thinking about for weeks now. \n\nOver the last few weeks, Leah had been driven mad with desire. She had cum so many times with naughty whispers in her ear.\n\n\"All your holes are going to be filled..\" \n\nMore and more the anticipation of hands roaming her body built. She was going to be the object of desire for a few men. \n\nIt had been some time since her one and only gangbang. She had been so nervous, not knowing what to expect. But this time she knew what she wanted from it. She could let loose this time and take it all in. \n\nThat crazy time had been with a FWB and two of his friends. It was an introduction to a sinful desire that only grew in hunger. \n\nShe padded across her apartment, one filled with plants and small furniture. She kept things clean and organized, traits that carried over to all parts of her life.\n\nLeah was very independent. She always had been out of necessity. But she was still feminine and soft. She baked and did yoga, had creative hobbies.. and, she liked dick. \n\nHer small overnight suitcase, packed the night before, waited ready by the door. \n\nLeah had an hour to shower and get ready before Andy would arrive to whisk her away. \n\nAs she undressed and made her way to the washroom, she thought it amusing how she found herself in this situation. \n\nShe was a successful engineer with a dirty secret. Not only was she an unassuming 'girl next door', she was also one with a sugar daddy named Andy.\n\nLeah had toyed with the idea of being a sugar baby for years. Knowing that someone desired her so badly they might pay to spend time with her excited her immensely.\n\nIn truth she didn't need the money, but it was certainly a nice bonus. It was the attention and lust she craved - to be the reason a man could be driven mad with need.\n\nOnce Andy had found out about her gangbang, he became invested in that fantasy. \n\nLeah liked rough sex. And it became apparent the idea of sharing her turned him on too. Andy became noticeably rougher and more dominant when grunting dirty things in her ear. \n\nHe would grab her hair by the base of the roots and yank her head back, fucking her hard from behind and say, \"I bet you'd love a dick shoved in your filthy mouth right now, huh?\"\n\nWith eyes tightly shut, she could only manage a simple guttural moan at the idea. \n\n\"We'd strap you down and fuck you raw! You're gonna be our slutty little plaything,\" was enough to push her over the edge as she shook from her orgasm.\n\nIt continued on like this until one day Andy asked if she might entertain the idea of having another gangbang with him and his friends. \n\nShe'd always liked the idea of more cocks. Leah had a high sex drive and craved more. She wanted it. All the time.\n\nShe wasn't expecting the first gangbang to happen and here she was with another opportunity to satiate that dirty fantasy once again.\n\nAndy knew she was open minded. She was the quiet little nympho that might just oblige. \n\nHe thought he was so lucky when he found her on the sugar daddy website.\n\nShe was 31, petite, 5'4\", dark hair, tanned, a gorgeous smile, small natural breasts, incredibly smooth skin (waxed and lasered), a true sweetheart and intelligent to boot.  \n\n\"I'll tell you what. Come away with me for a weekend and we'll sail the yacht out. We'll have drinks, sun, and amazing sex. We'll take care of you and make it a weekend you can't forget! And.. you'll come home with $15,000.\"\n\nThis was quite a jump in the allowance from their weekly visits.\n\nThe idea of multiple cocks driving in and out of her was already making her pussy wet... a weekend away on a yacht? \n\nLeah took a moment and bit her lip before saying, \"Ok. Let's do it!\"\n\nShe put on the final touches of her makeup and looked at herself in the mirror. Her grin grew wider and she gave her head a little shake in disbelief. \n\nLeah wore a white floral dress with a slip coming up her thighs. It was form fitting and she looked stunning.\n\nShe grabbed the suitcase, locked up and headed down to meet her daddy. \n\n\"You look so sexy, my dear. Are you ready?\" said Andy. \n\nShe looked to the ground and just nodded nervously. \n\nThey drove to the marina and made small talk, both keeping their nerves and excitement from boiling over. \n\nLeah crossed her legs, squeezing her thighs together as she looked out the window. Her pussy was already leaking knowing full well she was about to have three guys drilling her.\n\n\"Ok baby. I want you to be excited and surprised when we get there. Put this on,\" Andy says as he hands her a blindfold. \n\n\"No peeking until you cum first.\" he said with a wink. \n\nThey arrived at the marina and Andy gathered her things and escorted Leah down the ramp. \n\nAt the bottom of the ramp, Andy gave her hand to another gentleman.\n\n\"Hi Leah. You look *so* delicious. I'll take you over to the boat. I'm Dan by the way.\" said the man. \n\nHer heart beat even quicker as she slowly walked towards the boat on the arm of a stranger. \n\nThey boarded the yacht and she was led into the saloon and seated. With her blindfold still on, she felt someone sit next to her. A hand found its way to her thigh in the opening of the slit. It was warm and gently grasped her flesh. \n\n\"Here.. Lift out your hand, I've poured you a glass of champagne.\" said a new voice. \n\n'So this is the dick that's going to fill me up' she thought to herself. Her thong was thoroughly soaked now.\n\n\"Thank you,\" Leah said softly. \n\nShe felt the motor hum and the yacht began to move. \n\nFor the next 30 minutes she sat in total darkness, sipping champagne and chatting about sex. They asked her progressively more personal questions about her kinks. \n\nAt the same time, the hand had begun to massage and move inside her thigh. This belonged to Michael she found out. Another person sat on her other side and his hands began to roam along her lower back and other leg. \n\nAt this point Leah's breathing deepened, her mouth slightly apart. She was enjoying the caresses.\n\n\"I can't wait to see you take all of our cocks tonight,\" Dan said quietly into her ear. \n\n\"Ughnnn\" Leah let out. \n\nShe felt both men stop their caressing and stand up. She felt a finger under her chin, lifting slightly. \n\n\"Up.\" Michael stated. \n\nHer heart beat faster. Things were finally progressing and she was about to get what she'd been fantasizing about every day since her last gangbang. \n\nMichael took her hand and brought her forward a few steps. \n\n\"Watch your step,\" he said as they walked up onto a king-sized mattress placed in the centre of the room. \n\nStanding in the centre of the mattress she felt the guys close by. Hands were now squeezing her with more passion, no more teasing, but firm grabbing of her ass, her tits, her flesh.\n\nShe felt wet lips kiss her neck. A hand went inside the slit in her dress and palmed her mound. Leah gyrated her hips forward from the warm contact. \n\n\"She's so wet!\" Dan says excitedly. \n\nShe felt a third set of hands groping her from behind. He squeezed her breasts hard as he pulled her ass into his crotch. \n\nThey undressed her, sliding her dress down, and immediately replacing it with their mouths. Every inch of her body was being covered in licks and kisses. Up her naval, nipples sucked and chewed, her neck nuzzled. Leah's head buzzed. \n\n\"Baby, get on your knees.\" Andy said. \n\nHands continued to grope her, squeeze and pull her and she got down to her knees. Their hands became slick as they began massaging her with copious amounts of oil. \n\nA hand went around the back of her head and grasped her hair, pulling her forward. She felt the smooth, velvety skin of a cock press up against her cheek. It was so warm sliding across her face. \n\nHer head was pulled back a touch as she felt the bulbous head the dick pressed against her lips. She opened and came forward, taking it to the entrance of her throat. \n\n\"It's so big!' she thought of the 8\" cock. \n\nThe man held her by the hair and slowly pulled his cock all the way out, Leah dragging her lips along his shaft. With just the tip at her lips, he pushed back in slowly but firmly. \n\nLeah gagged a bit as it touched the back of her throat. She took a breath as he pulled out and began pushing back in. \n\nHe sawed in and out of her mouth slowly, gagging her every now and then. Pushing deeper and deeper each time. \n\nBy now her entire body was glistening in oil as the hands continued to play with her. Her mouth was getting fucked as hands pinched her nipples, fingers glided over her sopping pussy. \n\nThe man fucking her mouth was taking more control and picked up his rhythm. \n\nA man on either side of her, each one had a hand on her breast. One man had his other hand reaching down and slapping her ass, groping.. And the other had his hand around the front, rubbing her pussy. \n\nThe man shoving his cock in her mouth let go of her hair and placed hands on either side of her head. He began pulling her in more forcefully, fucking her face. \n\nLeah shut her eyes tightly, trying to relax her throat as cock forced its way further down with each thrust. She'd gag more rarely now, but each time making a noticeable hollow burp from her chest as she choked on cock. Her cheeks would blow out when this happened. \n\nThis only seemed to spur the man on - he gave her no time to reset. He just fucked her face with even longer and deeper strokes. \n\nIt was now that Leah felt the hands below start to explore further. She felt a finger at her asshole. Two others slide up inside her juicing pussy. \n\nAnother finger was worming its way up her asshole. Now she had both guys pulling their fingers up inside of her. They wanted to get deep inside the little slut. \n\nLeah could only manage small groans as the cock blocked her airway every other second. \n\nThey finger fucked her hard. Pulling their fingers just about all the way out and thrusting all the way back in. \n\nLeah's throat had now gotten used to the barrage and was allowing entry. \n\nThe man in front pulled her hard into his groin and buried his cock all the way down her throat. He held her there with her nose against his pubic mound. \n\nThere she stayed, cock all the way inside her throat, and fingers being fucked in and out of her pussy and asshole. \n\nAfter a few seconds she began to panic and pulled back. The man didn't let her and instead crushed her head against his crotch. \n\nLeah's arms waved out wildly, unsure what to do. She was still being probed and her tits were getting harshly kneaded and pinched at the same time. \n\nFinally the man relented and pulled all the way out. A long stream of saliva stretching from cock to mouth. \n\nLeah gagged and inhaled deeply. \n\nHer breath was abruptly interrupted as his cock returned and in one swift motion, shoved all the way back inside her throat. \n\nImmediately he pulled out only to ram himself back in.\n\nLeah was now being throat fucked hard. Gobs of spit drooling out from the corners of her mouth on every out-stroke. \n\nHe pumped her face, drawing his cock in and out of that sexy little mouth. \n\nHis thrusts slowed.. he humped her face two more times before bringing her close into his groin, fully buried to the hilt. \n\nHe let out a deep growl, hands pulling at the back of her head. \n\n\"Ugghhrrr\" \n\nHis cock swelled in her throat. And then she felt his shaft pulse, and pulse.. \n\nHe began unloading his cum inside of her. Leah felt her throat grow hot with his sperm. Her throat was being coated with jets of cum. \n\nShe felt so deliciously used. The pulsing prick in her mouth and throat triggered her own convulsions. Responding to the finger fucking, she tensed as her orgasm washed over her.\n\nLeah didn't even notice she couldn't breath with the cock lodged inside of her. She just twitched and convulsed as she climaxed on their hands.  \n\nAs the ripples subsided her body relaxed. The tension was releasing and she sunk back on her heels and the fingers still inside her messy holes. \n\nShe'd never felt so wet before. The guys found her pussy and asshole welcoming to their ministrations. They flowed in and out with ease. \n\nLeah was catching her breath. She was in a daze and lightheaded but thought that was a quick start. He came so quickly. \n\nBoth guys removed their figners from below and she fell forward onto her hands with her head drooping down.\n\n\"Baby. Take off your blindfold now.\"\n\nBeing so out of it she didn't even notice the unfamiliar voice. She just mindlessly reached up and pulled the blindfold down around her neck. \n\nShe winced as her eyes got used to the light. Her eyes drifted up and slowly came into focus. \n\nLeah's eyes got wide as she sat upright and placed her hands tightly in her lap. Her face became warm, her breathing quickened, heart beating faster. \n\nAll around her were hungry eyes staring intently. Andy hadn't brought two of his friends to recreate her gangbang. \n\nInstead, there were 15 guys all around her. They were holding beers, sitting on the couches, standing against the wall, and standing above her. \n\nSome men had their cocks out, slowly stroking them with one hand, drinking a beer with the other.\n\nIt was a mixed group of guys of different races and sizes, in every sense of the word. \n\nLeah looked around the room nervously. Her body was tensing as she shrunk inwards. She turned forward and thankfully saw Andy. He was standing in front of her now. \n\nShe looked up at him, a small furrow in her brow, doe-eyes pleading with him..\n\n\"Andy.. I..\" she squeaks timidly. \n\n\"I know, baby.\" Andy says, reaching out and stroking her cheek. \n\n\"You're gonna have all the cock you've ever wanted this weekend.\" \n\nAndy's hand moves behind her head and pulls her forward.\n\nUnsure what to do, Leah resists at first. Still looking up at him, \"Andy I don-\"\n\nBefore she can say more, Andy roughly shoves his dick in her mouth, hitting the back of her throat. Leah gags and Andy only presses harder and enters her throat fully. He holds her firmly in place, rooted inside his prized possession. \n\nWith a smirk on his face, he says to the guys, \"That's it, baby. Come get your sugar.\" \n\n  \nEDIT: [Part 2 here](https://www.reddit.com/r/sexstories/comments/yo7130/part_2_sugar_rush_a_sugar_babys_yacht_weekend_has/).","author":"wookiebanditohoh","author_fullname":"t2_dalnydxe","subreddit":"sexstories","subreddit_id":"t5_2qt19","created_utc":1667007412,"is_self":true,"url":"https://www.reddit.com/r/sexstories/comments/yg6jcx/sugar_rush_a_sugar_babys_yacht_weekend_has_more/","domain":"self.sexstories","post_hint":null,"is_gallery":false,"over_18":true,"spoiler":false,"link_flair_text":"Fiction ","is_original_content":false,"stickied":false,"locked":false,"edited":1727118965,"num_comments":0,"score":41,"upvote_ratio":0.95,"media":{"kind":"self","files":[]},"external_link":null,"raw_post":{"approved_at_utc":null,"subreddit":"sexstories","selftext":"At 430PM on a beautiful Friday afternoon Leah powered down her computer, grinning sheepishly to herself as she got up from her desk.\n\nShe was going away on a special trip out to sea, a trip she couldn't stop thinking about for weeks now. \n\nOver the last few weeks, Leah had been driven mad with desire. She had cum so many times with naughty whispers in her ear.\n\n\"All your holes are going to be filled..\" \n\nMore and more the anticipation of hands roaming her body built. She was going to be the object of desire for a few men. \n\nIt had been some time since her one and only gangbang. She had been so nervous, not knowing what to expect. But this time she knew what she wanted from it. She could let loose this time and take it all in. \n\nThat crazy time had been with a FWB and two of his friends. It was an introduction to a sinful desire that only grew in hunger. \n\nShe padded across her apartment, one filled with plants and small furniture. She kept things clean and organized, traits that carried over to all parts of her life.\n\nLeah was very independent. She always had been out of necessity. But she was still feminine and soft. She baked and did yoga, had creative hobbies.. and, she liked dick. \n\nHer small overnight suitcase, packed the night before, waited ready by the door. \n\nLeah had an hour to shower and get ready before Andy would arrive to whisk her away. \n\nAs she undressed and made her way to the washroom, she thought it amusing how she found herself in this situation. \n\nShe was a successful engineer with a dirty secret. Not only was she an unassuming 'girl next door', she was also one with a sugar daddy named Andy.\n\nLeah had toyed with the idea of being a sugar baby for years. Knowing that someone desired her so badly they might pay to spend time with her excited her immensely.\n\nIn truth she didn't need the money, but it was certainly a nice bonus. It was the attention and lust she craved - to be the reason a man could be driven mad with need.\n\nOnce Andy had found out about her gangbang, he became invested in that fantasy. \n\nLeah liked rough sex. And it became apparent the idea of sharing her turned him on too. Andy became noticeably rougher and more dominant when grunting dirty things in her ear. \n\nHe would grab her hair by the base of the roots and yank her head back, fucking her hard from behind and say, \"I bet you'd love a dick shoved in your filthy mouth right now, huh?\"\n\nWith eyes tightly shut, she could only manage a simple guttural moan at the idea. \n\n\"We'd strap you down and fuck you raw! You're gonna be our slutty little plaything,\" was enough to push her over the edge as she shook from her orgasm.\n\nIt continued on like this until one day Andy asked if she might entertain the idea of having another gangbang with him and his friends. \n\nShe'd always liked the idea of more cocks. Leah had a high sex drive and craved more. She wanted it. All the time.\n\nShe wasn't expecting the first gangbang to happen and here she was with another opportunity to satiate that dirty fantasy once again.\n\nAndy knew she was open minded. She was the quiet little nympho that might just oblige. \n\nHe thought he was so lucky when he found her on the sugar daddy website.\n\nShe was 31, petite, 5'4\", dark hair, tanned, a gorgeous smile, small natural breasts, incredibly smooth skin (waxed and lasered), a true sweetheart and intelligent to boot.  \n\n\"I'll tell you what. Come away with me for a weekend and we'll sail the yacht out. We'll have drinks, sun, and amazing sex. We'll take care of you and make it a weekend you can't forget! And.. you'll come home with $15,000.\"\n\nThis was quite a jump in the allowance from their weekly visits.\n\nThe idea of multiple cocks driving in and out of her was already making her pussy wet... a weekend away on a yacht? \n\nLeah took a moment and bit her lip before saying, \"Ok. Let's do it!\"\n\nShe put on the final touches of her makeup and looked at herself in the mirror. Her grin grew wider and she gave her head a little shake in disbelief. \n\nLeah wore a white floral dress with a slip coming up her thighs. It was form fitting and she looked stunning.\n\nShe grabbed the suitcase, locked up and headed down to meet her daddy. \n\n\"You look so sexy, my dear. Are you ready?\" said Andy. \n\nShe looked to the ground and just nodded nervously. \n\nThey drove to the marina and made small talk, both keeping their nerves and excitement from boiling over. \n\nLeah crossed her legs, squeezing her thighs together as she looked out the window. Her pussy was already leaking knowing full well she was about to have three guys drilling her.\n\n\"Ok baby. I want you to be excited and surprised when we get there. Put this on,\" Andy says as he hands her a blindfold. \n\n\"No peeking until you cum first.\" he said with a wink. \n\nThey arrived at the marina and Andy gathered her things and escorted Leah down the ramp. \n\nAt the bottom of the ramp, Andy gave her hand to another gentleman.\n\n\"Hi Leah. You look *so* delicious. I'll take you over to the boat. I'm Dan by the way.\" said the man. \n\nHer heart beat even quicker as she slowly walked towards the boat on the arm of a stranger. \n\nThey boarded the yacht and she was led into the saloon and seated. With her blindfold still on, she felt someone sit next to her. A hand found its way to her thigh in the opening of the slit. It was warm and gently grasped her flesh. \n\n\"Here.. Lift out your hand, I've poured you a glass of champagne.\" said a new voice. \n\n'So this is the dick that's going to fill me up' she thought to herself. Her thong was thoroughly soaked now.\n\n\"Thank you,\" Leah said softly. \n\nShe felt the motor hum and the yacht began to move. \n\nFor the next 30 minutes she sat in total darkness, sipping champagne and chatting about sex. They asked her progressively more personal questions about her kinks. \n\nAt the same time, the hand had begun to massage and move inside her thigh. This belonged to Michael she found out. Another person sat on her other side and his hands began to roam along her lower back and other leg. \n\nAt this point Leah's breathing deepened, her mouth slightly apart. She was enjoying the caresses.\n\n\"I can't wait to see you take all of our cocks tonight,\" Dan said quietly into her ear. \n\n\"Ughnnn\" Leah let out. \n\nShe felt both men stop their caressing and stand up. She felt a finger under her chin, lifting slightly. \n\n\"Up.\" Michael stated. \n\nHer heart beat faster. Things were finally progressing and she was about to get what she'd been fantasizing about every day since her last gangbang. \n\nMichael took her hand and brought her forward a few steps. \n\n\"Watch your step,\" he said as they walked up onto a king-sized mattress placed in the centre of the room. \n\nStanding in the centre of the mattress she felt the guys close by. Hands were now squeezing her with more passion, no more teasing, but firm grabbing of her ass, her tits, her flesh.\n\nShe felt wet lips kiss her neck. A hand went inside the slit in her dress and palmed her mound. Leah gyrated her hips forward from the warm contact. \n\n\"She's so wet!\" Dan says excitedly. \n\nShe felt a third set of hands groping her from behind. He squeezed her breasts hard as he pulled her ass into his crotch. \n\nThey undressed her, sliding her dress down, and immediately replacing it with their mouths. Every inch of her body was being covered in licks and kisses. Up her naval, nipples sucked and chewed, her neck nuzzled. Leah's head buzzed. \n\n\"Baby, get on your knees.\" Andy said. \n\nHands continued to grope her, squeeze and pull her and she got down to her knees. Their hands became slick as they began massaging her with copious amounts of oil. \n\nA hand went around the back of her head and grasped her hair, pulling her forward. She felt the smooth, velvety skin of a cock press up against her cheek. It was so warm sliding across her face. \n\nHer head was pulled back a touch as she felt the bulbous head the dick pressed against her lips. She opened and came forward, taking it to the entrance of her throat. \n\n\"It's so big!' she thought of the 8\" cock. \n\nThe man held her by the hair and slowly pulled his cock all the way out, Leah dragging her lips along his shaft. With just the tip at her lips, he pushed back in slowly but firmly. \n\nLeah gagged a bit as it touched the back of her throat. She took a breath as he pulled out and began pushing back in. \n\nHe sawed in and out of her mouth slowly, gagging her every now and then. Pushing deeper and deeper each time. \n\nBy now her entire body was glistening in oil as the hands continued to play with her. Her mouth was getting fucked as hands pinched her nipples, fingers glided over her sopping pussy. \n\nThe man fucking her mouth was taking more control and picked up his rhythm. \n\nA man on either side of her, each one had a hand on her breast. One man had his other hand reaching down and slapping her ass, groping.. And the other had his hand around the front, rubbing her pussy. \n\nThe man shoving his cock in her mouth let go of her hair and placed hands on either side of her head. He began pulling her in more forcefully, fucking her face. \n\nLeah shut her eyes tightly, trying to relax her throat as cock forced its way further down with each thrust. She'd gag more rarely now, but each time making a noticeable hollow burp from her chest as she choked on cock. Her cheeks would blow out when this happened. \n\nThis only seemed to spur the man on - he gave her no time to reset. He just fucked her face with even longer and deeper strokes. \n\nIt was now that Leah felt the hands below start to explore further. She felt a finger at her asshole. Two others slide up inside her juicing pussy. \n\nAnother finger was worming its way up her asshole. Now she had both guys pulling their fingers up inside of her. They wanted to get deep inside the little slut. \n\nLeah could only manage small groans as the cock blocked her airway every other second. \n\nThey finger fucked her hard. Pulling their fingers just about all the way out and thrusting all the way back in. \n\nLeah's throat had now gotten used to the barrage and was allowing entry. \n\nThe man in front pulled her hard into his groin and buried his cock all the way down her throat. He held her there with her nose against his pubic mound. \n\nThere she stayed, cock all the way inside her throat, and fingers being fucked in and out of her pussy and asshole. \n\nAfter a few seconds she began to panic and pulled back. The man didn't let her and instead crushed her head against his crotch. \n\nLeah's arms waved out wildly, unsure what to do. She was still being probed and her tits were getting harshly kneaded and pinched at the same time. \n\nFinally the man relented and pulled all the way out. A long stream of saliva stretching from cock to mouth. \n\nLeah gagged and inhaled deeply. \n\nHer breath was abruptly interrupted as his cock returned and in one swift motion, shoved all the way back inside her throat. \n\nImmediately he pulled out only to ram himself back in.\n\nLeah was now being throat fucked hard. Gobs of spit drooling out from the corners of her mouth on every out-stroke. \n\nHe pumped her face, drawing his cock in and out of that sexy little mouth. \n\nHis thrusts slowed.. he humped her face two more times before bringing her close into his groin, fully buried to the hilt. \n\nHe let out a deep growl, hands pulling at the back of her head. \n\n\"Ugghhrrr\" \n\nHis cock swelled in her throat. And then she felt his shaft pulse, and pulse.. \n\nHe began unloading his cum inside of her. Leah felt her throat grow hot with his sperm. Her throat was being coated with jets of cum. \n\nShe felt so deliciously used. The pulsing prick in her mouth and throat triggered her own convulsions. Responding to the finger fucking, she tensed as her orgasm washed over her.\n\nLeah didn't even notice she couldn't breath with the cock lodged inside of her. She just twitched and convulsed as she climaxed on their hands.  \n\nAs the ripples subsided her body relaxed. The tension was releasing and she sunk back on her heels and the fingers still inside her messy holes. \n\nShe'd never felt so wet before. The guys found her pussy and asshole welcoming to their ministrations. They flowed in and out with ease. \n\nLeah was catching her breath. She was in a daze and lightheaded but thought that was a quick start. He came so quickly. \n\nBoth guys removed their figners from below and she fell forward onto her hands with her head drooping down.\n\n\"Baby. Take off your blindfold now.\"\n\nBeing so out of it she didn't even notice the unfamiliar voice. She just mindlessly reached up and pulled the blindfold down around her neck. \n\nShe winced as her eyes got used to the light. Her eyes drifted up and slowly came into focus. \n\nLeah's eyes got wide as she sat upright and placed her hands tightly in her lap. Her face became warm, her breathing quickened, heart beating faster. \n\nAll around her were hungry eyes staring intently. Andy hadn't brought two of his friends to recreate her gangbang. \n\nInstead, there were 15 guys all around her. They were holding beers, sitting on the couches, standing against the wall, and standing above her. \n\nSome men had their cocks out, slowly stroking them with one hand, drinking a beer with the other.\n\nIt was a mixed group of guys of different races and sizes, in every sense of the word. \n\nLeah looked around the room nervously. Her body was tensing as she shrunk inwards. She turned forward and thankfully saw Andy. He was standing in front of her now. \n\nShe looked up at him, a small furrow in her brow, doe-eyes pleading with him..\n\n\"Andy.. I..\" she squeaks timidly. \n\n\"I know, baby.\" Andy says, reaching out and stroking her cheek. \n\n\"You're gonna have all the cock you've ever wanted this weekend.\" \n\nAndy's hand moves behind her head and pulls her forward.\n\nUnsure what to do, Leah resists at first. Still looking up at him, \"Andy I don-\"\n\nBefore she can say more, Andy roughly shoves his dick in her mouth, hitting the back of her throat. Leah gags and Andy only presses harder and enters her throat fully. He holds her firmly in place, rooted inside his prized possession. \n\nWith a smirk on his face, he says to the guys, \"That's it, baby. Come get your sugar.\" \n\n  \nEDIT: [Part 2 here](https://www.reddit.com/r/sexstories/comments/yo7130/part_2_sugar_rush_a_sugar_babys_yacht_weekend_has/).","user_reports":[],"saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"Sugar Rush: A sugar baby's yacht weekend has more seamen than expected [FM+, gangbang, CNC, rough] PART 1","link_flair_richtext":[],"subreddit_name_prefixed":"r/sexstories","hidden":false,"pwls":null,"link_flair_css_class":"","downs":0,"thumbnail_height":null,"top_awarded_type":null,"hide_score":false,"name":"t3_yg6jcx","quarantine":false,"link_flair_text_color":"dark","upvote_ratio":0.95,"author_flair_background_color":null,"subreddit_type":"public","ups":41,"total_awards_received":0,"media_embed":{},"thumbnail_width":null,"author_flair_template_id":null,"is_original_content":false,"author_fullname":"t2_dalnydxe","secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"Fiction ","can_mod_post":false,"score":41,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"self","edited":1727118965,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"content_categories":null,"is_self":true,"mod_note":null,"created":1667007412,"link_flair_type":"text","wls":null,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"self.sexstories","allow_live_comments":false,"selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At 430PM on a beautiful Friday afternoon Leah powered down her computer, grinning sheepishly to herself as she got up from her desk.&lt;/p&gt;\n\n&lt;p&gt;She was going away on a special trip out to sea, a trip she couldn&amp;#39;t stop thinking about for weeks now. &lt;/p&gt;\n\n&lt;p&gt;Over the last few weeks, Leah had been driven mad with desire. She had cum so many times with naughty whispers in her ear.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;All your holes are going to be filled..&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;More and more the anticipation of hands roaming her body built. She was going to be the object of desire for a few men. &lt;/p&gt;\n\n&lt;p&gt;It had been some time since her one and only gangbang. She had been so nervous, not knowing what to expect. But this time she knew what she wanted from it. She could let loose this time and take it all in. &lt;/p&gt;\n\n&lt;p&gt;That crazy time had been with a FWB and two of his friends. It was an introduction to a sinful desire that only grew in hunger. &lt;/p&gt;\n\n&lt;p&gt;She padded across her apartment, one filled with plants and small furniture. She kept things clean and organized, traits that carried over to all parts of her life.&lt;/p&gt;\n\n&lt;p&gt;Leah was very independent. She always had been out of necessity. But she was still feminine and soft. She baked and did yoga, had creative hobbies.. and, she liked dick. &lt;/p&gt;\n\n&lt;p&gt;Her small overnight suitcase, packed the night before, waited ready by the door. &lt;/p&gt;\n\n&lt;p&gt;Leah had an hour to shower and get ready before Andy would arrive to whisk her away. &lt;/p&gt;\n\n&lt;p&gt;As she undressed and made her way to the washroom, she thought it amusing how she found herself in this situation. &lt;/p&gt;\n\n&lt;p&gt;She was a successful engineer with a dirty secret. Not only was she an unassuming &amp;#39;girl next door&amp;#39;, she was also one with a sugar daddy named Andy.&lt;/p&gt;\n\n&lt;p&gt;Leah had toyed with the idea of being a sugar baby for years. Knowing that someone desired her so badly they might pay to spend time with her excited her immensely.&lt;/p&gt;\n\n&lt;p&gt;In truth she didn&amp;#39;t need the money, but it was certainly a nice bonus. It was the attention and lust she craved - to be the reason a man could be driven mad with need.&lt;/p&gt;\n\n&lt;p&gt;Once Andy had found out about her gangbang, he became invested in that fantasy. &lt;/p&gt;\n\n&lt;p&gt;Leah liked rough sex. And it became apparent the idea of sharing her turned him on too. Andy became noticeably rougher and more dominant when grunting dirty things in her ear. &lt;/p&gt;\n\n&lt;p&gt;He would grab her hair by the base of the roots and yank her head back, fucking her hard from behind and say, &amp;quot;I bet you&amp;#39;d love a dick shoved in your filthy mouth right now, huh?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;With eyes tightly shut, she could only manage a simple guttural moan at the idea. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We&amp;#39;d strap you down and fuck you raw! You&amp;#39;re gonna be our slutty little plaything,&amp;quot; was enough to push her over the edge as she shook from her orgasm.&lt;/p&gt;\n\n&lt;p&gt;It continued on like this until one day Andy asked if she might entertain the idea of having another gangbang with him and his friends. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;d always liked the idea of more cocks. Leah had a high sex drive and craved more. She wanted it. All the time.&lt;/p&gt;\n\n&lt;p&gt;She wasn&amp;#39;t expecting the first gangbang to happen and here she was with another opportunity to satiate that dirty fantasy once again.&lt;/p&gt;\n\n&lt;p&gt;Andy knew she was open minded. She was the quiet little nympho that might just oblige. &lt;/p&gt;\n\n&lt;p&gt;He thought he was so lucky when he found her on the sugar daddy website.&lt;/p&gt;\n\n&lt;p&gt;She was 31, petite, 5&amp;#39;4&amp;quot;, dark hair, tanned, a gorgeous smile, small natural breasts, incredibly smooth skin (waxed and lasered), a true sweetheart and intelligent to boot.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ll tell you what. Come away with me for a weekend and we&amp;#39;ll sail the yacht out. We&amp;#39;ll have drinks, sun, and amazing sex. We&amp;#39;ll take care of you and make it a weekend you can&amp;#39;t forget! And.. you&amp;#39;ll come home with $15,000.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This was quite a jump in the allowance from their weekly visits.&lt;/p&gt;\n\n&lt;p&gt;The idea of multiple cocks driving in and out of her was already making her pussy wet... a weekend away on a yacht? &lt;/p&gt;\n\n&lt;p&gt;Leah took a moment and bit her lip before saying, &amp;quot;Ok. Let&amp;#39;s do it!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She put on the final touches of her makeup and looked at herself in the mirror. Her grin grew wider and she gave her head a little shake in disbelief. &lt;/p&gt;\n\n&lt;p&gt;Leah wore a white floral dress with a slip coming up her thighs. It was form fitting and she looked stunning.&lt;/p&gt;\n\n&lt;p&gt;She grabbed the suitcase, locked up and headed down to meet her daddy. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You look so sexy, my dear. Are you ready?&amp;quot; said Andy. &lt;/p&gt;\n\n&lt;p&gt;She looked to the ground and just nodded nervously. &lt;/p&gt;\n\n&lt;p&gt;They drove to the marina and made small talk, both keeping their nerves and excitement from boiling over. &lt;/p&gt;\n\n&lt;p&gt;Leah crossed her legs, squeezing her thighs together as she looked out the window. Her pussy was already leaking knowing full well she was about to have three guys drilling her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ok baby. I want you to be excited and surprised when we get there. Put this on,&amp;quot; Andy says as he hands her a blindfold. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No peeking until you cum first.&amp;quot; he said with a wink. &lt;/p&gt;\n\n&lt;p&gt;They arrived at the marina and Andy gathered her things and escorted Leah down the ramp. &lt;/p&gt;\n\n&lt;p&gt;At the bottom of the ramp, Andy gave her hand to another gentleman.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi Leah. You look &lt;em&gt;so&lt;/em&gt; delicious. I&amp;#39;ll take you over to the boat. I&amp;#39;m Dan by the way.&amp;quot; said the man. &lt;/p&gt;\n\n&lt;p&gt;Her heart beat even quicker as she slowly walked towards the boat on the arm of a stranger. &lt;/p&gt;\n\n&lt;p&gt;They boarded the yacht and she was led into the saloon and seated. With her blindfold still on, she felt someone sit next to her. A hand found its way to her thigh in the opening of the slit. It was warm and gently grasped her flesh. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Here.. Lift out your hand, I&amp;#39;ve poured you a glass of champagne.&amp;quot; said a new voice. &lt;/p&gt;\n\n&lt;p&gt;&amp;#39;So this is the dick that&amp;#39;s going to fill me up&amp;#39; she thought to herself. Her thong was thoroughly soaked now.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Thank you,&amp;quot; Leah said softly. &lt;/p&gt;\n\n&lt;p&gt;She felt the motor hum and the yacht began to move. &lt;/p&gt;\n\n&lt;p&gt;For the next 30 minutes she sat in total darkness, sipping champagne and chatting about sex. They asked her progressively more personal questions about her kinks. &lt;/p&gt;\n\n&lt;p&gt;At the same time, the hand had begun to massage and move inside her thigh. This belonged to Michael she found out. Another person sat on her other side and his hands began to roam along her lower back and other leg. &lt;/p&gt;\n\n&lt;p&gt;At this point Leah&amp;#39;s breathing deepened, her mouth slightly apart. She was enjoying the caresses.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can&amp;#39;t wait to see you take all of our cocks tonight,&amp;quot; Dan said quietly into her ear. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ughnnn&amp;quot; Leah let out. &lt;/p&gt;\n\n&lt;p&gt;She felt both men stop their caressing and stand up. She felt a finger under her chin, lifting slightly. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Up.&amp;quot; Michael stated. &lt;/p&gt;\n\n&lt;p&gt;Her heart beat faster. Things were finally progressing and she was about to get what she&amp;#39;d been fantasizing about every day since her last gangbang. &lt;/p&gt;\n\n&lt;p&gt;Michael took her hand and brought her forward a few steps. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Watch your step,&amp;quot; he said as they walked up onto a king-sized mattress placed in the centre of the room. &lt;/p&gt;\n\n&lt;p&gt;Standing in the centre of the mattress she felt the guys close by. Hands were now squeezing her with more passion, no more teasing, but firm grabbing of her ass, her tits, her flesh.&lt;/p&gt;\n\n&lt;p&gt;She felt wet lips kiss her neck. A hand went inside the slit in her dress and palmed her mound. Leah gyrated her hips forward from the warm contact. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;She&amp;#39;s so wet!&amp;quot; Dan says excitedly. &lt;/p&gt;\n\n&lt;p&gt;She felt a third set of hands groping her from behind. He squeezed her breasts hard as he pulled her ass into his crotch. &lt;/p&gt;\n\n&lt;p&gt;They undressed her, sliding her dress down, and immediately replacing it with their mouths. Every inch of her body was being covered in licks and kisses. Up her naval, nipples sucked and chewed, her neck nuzzled. Leah&amp;#39;s head buzzed. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Baby, get on your knees.&amp;quot; Andy said. &lt;/p&gt;\n\n&lt;p&gt;Hands continued to grope her, squeeze and pull her and she got down to her knees. Their hands became slick as they began massaging her with copious amounts of oil. &lt;/p&gt;\n\n&lt;p&gt;A hand went around the back of her head and grasped her hair, pulling her forward. She felt the smooth, velvety skin of a cock press up against her cheek. It was so warm sliding across her face. &lt;/p&gt;\n\n&lt;p&gt;Her head was pulled back a touch as she felt the bulbous head the dick pressed against her lips. She opened and came forward, taking it to the entrance of her throat. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s so big!&amp;#39; she thought of the 8&amp;quot; cock. &lt;/p&gt;\n\n&lt;p&gt;The man held her by the hair and slowly pulled his cock all the way out, Leah dragging her lips along his shaft. With just the tip at her lips, he pushed back in slowly but firmly. &lt;/p&gt;\n\n&lt;p&gt;Leah gagged a bit as it touched the back of her throat. She took a breath as he pulled out and began pushing back in. &lt;/p&gt;\n\n&lt;p&gt;He sawed in and out of her mouth slowly, gagging her every now and then. Pushing deeper and deeper each time. &lt;/p&gt;\n\n&lt;p&gt;By now her entire body was glistening in oil as the hands continued to play with her. Her mouth was getting fucked as hands pinched her nipples, fingers glided over her sopping pussy. &lt;/p&gt;\n\n&lt;p&gt;The man fucking her mouth was taking more control and picked up his rhythm. &lt;/p&gt;\n\n&lt;p&gt;A man on either side of her, each one had a hand on her breast. One man had his other hand reaching down and slapping her ass, groping.. And the other had his hand around the front, rubbing her pussy. &lt;/p&gt;\n\n&lt;p&gt;The man shoving his cock in her mouth let go of her hair and placed hands on either side of her head. He began pulling her in more forcefully, fucking her face. &lt;/p&gt;\n\n&lt;p&gt;Leah shut her eyes tightly, trying to relax her throat as cock forced its way further down with each thrust. She&amp;#39;d gag more rarely now, but each time making a noticeable hollow burp from her chest as she choked on cock. Her cheeks would blow out when this happened. &lt;/p&gt;\n\n&lt;p&gt;This only seemed to spur the man on - he gave her no time to reset. He just fucked her face with even longer and deeper strokes. &lt;/p&gt;\n\n&lt;p&gt;It was now that Leah felt the hands below start to explore further. She felt a finger at her asshole. Two others slide up inside her juicing pussy. &lt;/p&gt;\n\n&lt;p&gt;Another finger was worming its way up her asshole. Now she had both guys pulling their fingers up inside of her. They wanted to get deep inside the little slut. &lt;/p&gt;\n\n&lt;p&gt;Leah could only manage small groans as the cock blocked her airway every other second. &lt;/p&gt;\n\n&lt;p&gt;They finger fucked her hard. Pulling their fingers just about all the way out and thrusting all the way back in. &lt;/p&gt;\n\n&lt;p&gt;Leah&amp;#39;s throat had now gotten used to the barrage and was allowing entry. &lt;/p&gt;\n\n&lt;p&gt;The man in front pulled her hard into his groin and buried his cock all the way down her throat. He held her there with her nose against his pubic mound. &lt;/p&gt;\n\n&lt;p&gt;There she stayed, cock all the way inside her throat, and fingers being fucked in and out of her pussy and asshole. &lt;/p&gt;\n\n&lt;p&gt;After a few seconds she began to panic and pulled back. The man didn&amp;#39;t let her and instead crushed her head against his crotch. &lt;/p&gt;\n\n&lt;p&gt;Leah&amp;#39;s arms waved out wildly, unsure what to do. She was still being probed and her tits were getting harshly kneaded and pinched at the same time. &lt;/p&gt;\n\n&lt;p&gt;Finally the man relented and pulled all the way out. A long stream of saliva stretching from cock to mouth. &lt;/p&gt;\n\n&lt;p&gt;Leah gagged and inhaled deeply. &lt;/p&gt;\n\n&lt;p&gt;Her breath was abruptly interrupted as his cock returned and in one swift motion, shoved all the way back inside her throat. &lt;/p&gt;\n\n&lt;p&gt;Immediately he pulled out only to ram himself back in.&lt;/p&gt;\n\n&lt;p&gt;Leah was now being throat fucked hard. Gobs of spit drooling out from the corners of her mouth on every out-stroke. &lt;/p&gt;\n\n&lt;p&gt;He pumped her face, drawing his cock in and out of that sexy little mouth. &lt;/p&gt;\n\n&lt;p&gt;His thrusts slowed.. he humped her face two more times before bringing her close into his groin, fully buried to the hilt. &lt;/p&gt;\n\n&lt;p&gt;He let out a deep growl, hands pulling at the back of her head. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ugghhrrr&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;His cock swelled in her throat. And then she felt his shaft pulse, and pulse.. &lt;/p&gt;\n\n&lt;p&gt;He began unloading his cum inside of her. Leah felt her throat grow hot with his sperm. Her throat was being coated with jets of cum. &lt;/p&gt;\n\n&lt;p&gt;She felt so deliciously used. The pulsing prick in her mouth and throat triggered her own convulsions. Responding to the finger fucking, she tensed as her orgasm washed over her.&lt;/p&gt;\n\n&lt;p&gt;Leah didn&amp;#39;t even notice she couldn&amp;#39;t breath with the cock lodged inside of her. She just twitched and convulsed as she climaxed on their hands.  &lt;/p&gt;\n\n&lt;p&gt;As the ripples subsided her body relaxed. The tension was releasing and she sunk back on her heels and the fingers still inside her messy holes. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;d never felt so wet before. The guys found her pussy and asshole welcoming to their ministrations. They flowed in and out with ease. &lt;/p&gt;\n\n&lt;p&gt;Leah was catching her breath. She was in a daze and lightheaded but thought that was a quick start. He came so quickly. &lt;/p&gt;\n\n&lt;p&gt;Both guys removed their figners from below and she fell forward onto her hands with her head drooping down.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Baby. Take off your blindfold now.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Being so out of it she didn&amp;#39;t even notice the unfamiliar voice. She just mindlessly reached up and pulled the blindfold down around her neck. &lt;/p&gt;\n\n&lt;p&gt;She winced as her eyes got used to the light. Her eyes drifted up and slowly came into focus. &lt;/p&gt;\n\n&lt;p&gt;Leah&amp;#39;s eyes got wide as she sat upright and placed her hands tightly in her lap. Her face became warm, her breathing quickened, heart beating faster. &lt;/p&gt;\n\n&lt;p&gt;All around her were hungry eyes staring intently. Andy hadn&amp;#39;t brought two of his friends to recreate her gangbang. &lt;/p&gt;\n\n&lt;p&gt;Instead, there were 15 guys all around her. They were holding beers, sitting on the couches, standing against the wall, and standing above her. &lt;/p&gt;\n\n&lt;p&gt;Some men had their cocks out, slowly stroking them with one hand, drinking a beer with the other.&lt;/p&gt;\n\n&lt;p&gt;It was a mixed group of guys of different races and sizes, in every sense of the word. &lt;/p&gt;\n\n&lt;p&gt;Leah looked around the room nervously. Her body was tensing as she shrunk inwards. She turned forward and thankfully saw Andy. He was standing in front of her now. &lt;/p&gt;\n\n&lt;p&gt;She looked up at him, a small furrow in her brow, doe-eyes pleading with him..&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Andy.. I..&amp;quot; she squeaks timidly. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I know, baby.&amp;quot; Andy says, reaching out and stroking her cheek. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re gonna have all the cock you&amp;#39;ve ever wanted this weekend.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Andy&amp;#39;s hand moves behind her head and pulls her forward.&lt;/p&gt;\n\n&lt;p&gt;Unsure what to do, Leah resists at first. Still looking up at him, &amp;quot;Andy I don-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Before she can say more, Andy roughly shoves his dick in her mouth, hitting the back of her throat. Leah gags and Andy only presses harder and enters her throat fully. He holds her firmly in place, rooted inside his prized possession. &lt;/p&gt;\n\n&lt;p&gt;With a smirk on his face, he says to the guys, &amp;quot;That&amp;#39;s it, baby. Come get your sugar.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;EDIT: &lt;a href=\"https://www.reddit.com/r/sexstories/comments/yo7130/part_2_sugar_rush_a_sugar_babys_yacht_weekend_has/\"&gt;Part 2 here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;","likes":null,"suggested_sort":"confidence","banned_at_utc":null,"view_count":null,"archived":false,"no_follow":false,"is_crosspostable":false,"pinned":false,"over_18":true,"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"6afbb1e0-92e8-11e9-8932-0e53a2722306","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"num_reports":null,"distinguished":null,"subreddit_id":"t5_2qt19","author_is_blocked":false,"mod_reason_by":null,"removal_reason":null,"link_flair_background_color":"#dadada","id":"yg6jcx","is_robot_indexable":true,"num_duplicates":0,"report_reasons":null,"author":"wookiebanditohoh","discussion_type":null,"num_comments":0,"send_replies":true,"media":null,"contest_mode":false,"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"/r/sexstories/comments/yg6jcx/sugar_rush_a_sugar_babys_yacht_weekend_has_more/","stickied":false,"url":"https://www.reddit.com/r/sexstories/comments/yg6jcx/sugar_rush_a_sugar_babys_yacht_weekend_has_more/","subreddit_subscribers":702242,"created_utc":1667007412,"num_crossposts":0,"mod_reports":[],"is_video":false},"raw_comments":{"kind":"Listing","data":{"after":null,"dist":null,"modhash":"","geo_filter":"","children":[],"before":null}},"comments":[],"media_kind":"self"}