[
  {
    "title": "I (31f) got fucked by my bf (31m) so hard today because I kept teasing him.",
    "subreddit": "SluttyConfessions",
    "author": "dilapidatedfungus",
    "over_18": true,
    "spoiler": false,
    "created_utc": 1706333756,
    "score": 632,
    "num_comments": 48,
    "url": "https://www.reddit.com/r/SluttyConfessions/comments/1ac3l3q/i_31f_got_fucked_by_my_bf_31m_so_hard_today/",
    "selftext": "My bf and I got into deep conversation about life, work, our future. I will admit I kinda ranted about a friend that ticked me off. We spoke for over an hour and as our conversation was winding down we got a little flirty. Now, I love teasing my bf. Fun little comments here and there, and I take the opportunity when I can. \n\nHe was sitting on his chair and said to me, \"get your butt over I want to kiss you\". So I walked backwards to him, sticking my butt out 😅 \n\nHe gave it a smack and pulled me in for a hug. I told him, \"you said my butt!\"\n\nWe got up from his chair and he asked for  a kiss and I'm like sure. He then said \"you have the cutest butt\" and I replied to him, \"how many other butts are you looking at to know I have the cutest!?\"\n\nI totally caught him off guard and he started to stumble his words, but he eventually recovered. I gave him a friendly reminder that he need to pick his words more carefully. This man then pushes me against the wall, stands over me looking in my eyes and says, \"the more you tease me the harder I'm going to fuck you\". I replied, \"I'd like to see you try\"\n\nWell... he picked me up, took me to the bed, and threw me on it. He didn't hesitate to pin me down and kiss me, bite my neck, and call me his fucking slut. I told him he'd have to try harder..\n\nHe became sooo aggressive. He climbed ontop of me and face fucked me while I was laying on the bed!! No hesitation, no going easy on me, I laid there and took his cock in my throat! \n\nAfter a minute or two of that, he putnme on all fours and spanked me hard. He told me to count every time I was spanked. \n\"One, sir. Two, sir..\"\n\nWhen we got to ten, he slid his cock inside me.. fuck he feels so good. He pulled my hair while fucking me from behind (something I love). It didn't take long until I orgasmed on his cock...\n\nThe rest was me getting tossed around, pinned against the wall and fucked, pinned down again, called a slut, a whore.. relentlessly fucked and bitten and degraded.. untill he cummed inside soooo hard! He yelled as he fucking exploded while I once again orgasmed on his dick.\n\nAfter that, we cuddled. He gave me a massage, told me he loves me, and got me some pepsi and cheese &amp; crackers. He recently passed out and I'm still here relaxing..\n\nI love him 🥰",
    "hasMedia": false,
    "mediaType": "text"
  },
  {
    "title": "My gf got used at her University reunion",
    "subreddit": "sexstories",
    "author": "[deleted]",
    "over_18": true,
    "spoiler": false,
    "created_utc": 1706518820,
    "score": 89,
    "num_comments": 5,
    "url": "https://www.reddit.com/r/sexstories/comments/1adqy6n/my_gf_got_used_at_her_university_reunion/",
    "selftext": "Me and my gf Lia met at University in our final year, despite both doing separate courses. She never really told me much about her first 2 years other than the fact she was seeing a guy who ended up cheating on her. Anyway a few of her friends who she keeps in contact with decided to organize a reunion and told everyone to invite partners as well. Because the university we went to is a three hour drive from where we live, we decided to book a hotel for a couple of nights and make a weekend of it. \n\nFast forward to the Saturday and my gf had just finished getting ready, she looked amazing and was some tight black jeans which made her ass look so sexy, black heels and a crop top which showed off a lot of cleavage. We arrived at this bar and the back section had been reserved for people attending the reunion. Everyone introduced everyone and the night started. A few hours later I noticed 3 guys walk in the bar and Lia looked kinda nervous at this point but I wasn’t sure why. The guys were Ronan, Sam and Daniel, who just kind of kept in the corner of the bar not speaking to anyone else. It got to about 11pm and most people had left by this point, my gf was pretty drunk but still decided she wanted another drink before we planned on heading back to the hotel. I noticed that Ronan was looking at Lia a lot throughout the night and she was doing the same back, so I asked if they wanted to come and sit with us for a bit and they agreed. They were all planning on going to a club after and my gf was down for the idea so we agreed to go with them. \n\nAs we were walking to the next place, I asked her about Ronan and it turns out he was the guy she was seeing for the first two years of Uni. Part of me was jealous that he was here and they obviously had a lot of tension between them, but then another part of me found it quite hot. We got to the club and were dancing together as a 5 before I headed off to the bathroom, when I returned I noticed they weren’t in the place that they were before. I walked into the next room and from a distance could see my gf dancing with the three of them, she was grinding her ass against Ronan with her head thrown back onto his chest while the other two guys were dancing in front of them. She then swapped who she was grinding and had moved to Daniel and started doing the exact same to him, I decided to go to the bar to get a drink and leave her to it as I could tell she was enjoying herself. After a couple of minutes I text her “why don’t you choose your favorite one and we can head back to the hotel;)”. She didn’t look at her phone for what felt like an age until I saw her reply, “but they are all hot, and I’m horny” I knew at this point she wanted at least two of them if not more. \n\nWe got back to the hotel, the guys sat on the bed and Lia walked over to me and started making out with me in the middle of the room. She then kicked off her heels, and began removing her jeans. I could see the guys staring at her ass while she was stood in her black lace panties, and then she removed her top. I knew the guys felt quite awkward because I was there so I decided to head in to the bathroom to give them some space and see what happened. As I was closing the door I could hear them complimenting her body and telling her how hot she looked. I heard slapping sounds and knew the guys were getting to grips with her sexy ass. After about 5 minutes I walked out, when I walked into the room I could see Lia naked on all fours while Daniel was behind her eating her pussy and Sam and Ronan were laid on the bed rock hard. Lia was going back and forth between sucking their cocks but she was definitely spending a lot more time on Ronan’s. After a couple more minutes of Daniel eating her pussy she came, “oh fuck you made me cum” she told him. \n\nDaniel pulled away and I could see her juices all over his mouth, he moved around to the front and started making out with her, giving her a taste of herself. With that Ronan got up and stood behind her, he was so hard and I knew he was desperate to fuck Lia again. He began sliding his cock up and down her pussy, “do you want this cock back inside sexy”, “omg yes, I need you back inside me Ronan” she begged him. And with that he slammed his cock so hard inside her pussy. She let out a loud moan, he began fucking her so hard and deep and spanking her sexy ass. She was trying to suck daniels cock at the same time but with how hard she was moaning this was a real struggle. He carried on at the same speed before telling her he was going to cum, “that’s it cum inside me like you used to” she said and he let out of a big moan, before sliding his cock out of her. I could see the cum dripping down her leg but could also see she was so full from his big load. Before she even had chance to speak, Sam had slid his cock into her pussy and began fucking her. Her moans weren’t as loud with him, and she then began deep throating Daniels cock at the same time. Seeing her getting spit roasted was so sexy and she handled it so well. After a couple of minutes Daniel had pulled his cock out of Lias mouth and had covered her face with his cum, I think seeing this tipped Sam over the edge and he let out of a huge moan and filled her up for second time that night. \n\nLia collapsed onto the bed on her back, she was covered in cum. It was all over her face, some had dripped onto her tits and her pussy was leaking with it as well. The guys all got changed and thanked us for a great night before i added a third load into her pussy. Happy to talk about Lia as well if anyone wants to DM me",
    "hasMedia": false,
    "mediaType": "text"
  },
  {
    "title": "What REALLY HAPPENED!!! You guys deserve to know the truth!",
    "subreddit": "SanDiegoAdultTheater3",
    "author": "[deleted]",
    "over_18": true,
    "spoiler": false,
    "created_utc": 1706530108,
    "score": 99,
    "num_comments": 62,
    "url": "https://www.reddit.com/r/SanDiegoAdultTheater3/comments/1adttjx/what_really_happened_you_guys_deserve_to_know_the/",
    "selftext": "[removed]",
    "hasMedia": false,
    "mediaType": "text"
  },
  {
    "title": "I had so much fun today! I loved having all the hands grope me!",
    "subreddit": "SanDiegoAdultTheater3",
    "author": "lucyluvin",
    "over_18": true,
    "spoiler": false,
    "created_utc": 1707012940,
    "score": 223,
    "num_comments": 33,
    "url": "https://www.redgifs.com/watch/neardroopyswellfish",
    "selftext": "",
    "hasMedia": false
  },
  {
    "title": "I was about to go to train and my boyfriend made me want his cock and I ended up draining it on my face",
    "subreddit": "cumsluts",
    "author": "CutePsychosFuck",
    "over_18": true,
    "spoiler": false,
    "created_utc": 1708633205,
    "score": 9443,
    "num_comments": 46,
    "url": "https://v3.redgifs.com/watch/waterycoordinatedkillifish",
    "selftext": "",
    "hasMedia": false
  }
]